import pytest
import pandas as pd
from pandas import DataFrame


@pytest.fixture
def return_excel():
    return [
    {
        'Дата операции': '01.12.2021 16:44:00',
        'Дата платежа': '01.12.2021',
        'Номер карты': '*7197',
        'Сумма операции': -160.89,
        'Сумма платежа': -160.89,
        'Категория': 'Супермаркеты',
        'Описание': 'Колхоз',
    },
    {
         'Дата операции': '02.12.2021 16:42:04',
         'Дата платежа': '02.12.2021',
         'Номер карты': '*7197',
         'Сумма операции': -64.0,
         'Сумма платежа': -64.0,
         'Категория': 'Супермаркеты',
         'Описание': 'Колхоз',
    },
    {
         'Дата операции': '03.12.2021 16:39:04',
         'Дата платежа': '03.12.2021',
         'Номер карты': '*7197',
         'Сумма операции': -118.12,
         'Сумма платежа': -118.12,
         'Категория': 'Супермаркеты',
         'Описание': 'Магнит',
    },
    {
        'Дата операции': '04.12.2021 15:44:39',
        'Дата платежа': '04.12.2021',
        'Номер карты': '*7197',
        'Сумма операции': -78.05,
        'Сумма платежа': -78.05,
        'Категория': 'Супермаркеты',
        'Описание': 'Колхоз',
    },
    {
        'Дата операции': '05.12.2021 01:23:42',
        'Дата платежа': '01.12.2021',
        'Номер карты': '*5091',
        'Сумма операции': -564.0,
        'Сумма платежа': -564.0,
        'Категория': 'Различные товары',
        'Описание': 'Ozon.ru',
    }]


@pytest.fixture
def return_sorted_dataframe():
    return pd.DataFrame({
                        'Дата операции': ['01.12.2021 16:44:00',
                                          '01.12.2021 17:44:00',
                                          '02.12.2021 16:42:04',
                                          '02.12.2021 18:42:04',
                                          '03.12.2021 16:39:04',
                                          '04.12.2021 18:39:04'],
                        'Дата платежа': ['01.12.2021',
                                         '01.12.2021',
                                         '02.12.2021',
                                         '02.12.2021',
                                         '03.12.2021',
                                         '04.12.2021'],
                        'Номер карты': ['*7197', '*7197', '*7197', '*1234', '*1234', '*1234'],
                        'Сумма операции': [-160.89, -64.0, -118.12, -51, -20, -1000],
                        'Сумма платежа': [-160.89, -64.0, -118.12, -51, -20, -1000],
                        'Категория': ['Супермаркеты',
                                      'Супермаркеты',
                                      'Такси',
                                      'Такси',
                                      'Такси',
                                      'Супермаркеты'],
                        'Описание': ['Колхоз',
                                     'Колхоз',
                                     'Вези меня',
                                     'Вези меня',
                                     'Вези меня',
                                     'Магнит'],
                        })