import pytest

@pytest.fixture
def return_excel():
    return [
    {
        'Дата операции': '01.12.2021 16:44:00',
        'Дата платежа': '01.12.2021',
        'Номер карты': '*7197',
        'Сумма операции': -160.89,
        'Сумма платежа': -160.89,
        'Категория': 'Супермаркеты',
        'Описание': 'Колхоз',
    },
    {
         'Дата операции': '02.12.2021 16:42:04',
         'Дата платежа': '02.12.2021',
         'Номер карты': '*7197',
         'Сумма операции': -64.0,
         'Сумма платежа': -64.0,
         'Категория': 'Супермаркеты',
         'Описание': 'Колхоз',
    },
    {
         'Дата операции': '03.12.2021 16:39:04',
         'Дата платежа': '03.12.2021',
         'Номер карты': '*7197',
         'Сумма операции': -118.12,
         'Сумма платежа': -118.12,
         'Категория': 'Супермаркеты',
         'Описание': 'Магнит',
    },
    {
        'Дата операции': '04.12.2021 15:44:39',
        'Дата платежа': '04.12.2021',
        'Номер карты': '*7197',
        'Сумма операции': -78.05,
        'Сумма платежа': -78.05,
        'Категория': 'Супермаркеты',
        'Описание': 'Колхоз',
    },
    {
        'Дата операции': '05.12.2021 01:23:42',
        'Дата платежа': '01.12.2021',
        'Номер карты': '*5091',
        'Сумма операции': -564.0,
        'Сумма платежа': -564.0,
        'Категория': 'Различные товары',
        'Описание': 'Ozon.ru',
    }]
